#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tech-challenge-fiap-fastfood/tech-challenge/runs/run-pUt8x51RxV83jhyp

Waiting for the plan to start...

Terraform v1.11.2
on linux_amd64
Initializing plugins and modules...
data.aws_ami.ubuntu: Refreshing...
data.aws_availability_zones.available: Refreshing...
aws_internet_gateway.gw: Refreshing state... [id=igw-0930f7ac187be0c97]
aws_security_group.web-sg: Refreshing state... [id=sg-04beb53515b532a75]
data.aws_availability_zones.available: Refresh complete after 0s [id=us-east-1]
aws_subnet.main: Refreshing state... [id=subnet-0b7b19160603a5ff5]
aws_route_table.public: Refreshing state... [id=rtb-02660e9c8ab07c45d]
data.aws_ami.ubuntu: Refresh complete after 0s [id=ami-0718b4ac01274c8cb]
aws_instance.app_server: Refreshing state... [id=i-03eab73c7bf0c532c]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-0b34db79119b605cc]
aws_eip.elastic_ip: Refreshing state... [id=eipalloc-0a2fc7203f38cbb0c]
aws_internet_gateway.gw: Drift detected (delete)
aws_route_table.public: Drift detected (delete)
aws_route_table_association.public: Drift detected (delete)
aws_eip.elastic_ip: Drift detected (delete)
aws_instance.app_server: Drift detected (delete)
aws_security_group.web-sg: Drift detected (delete)
aws_subnet.main: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eip.elastic_ip has been deleted
  - resource "aws_eip" "elastic_ip" {
        id                   = "eipalloc-0a2fc7203f38cbb0c"
      - public_ip            = "34.203.183.156" -> null
        # (12 unchanged attributes hidden)
    }

  # aws_instance.app_server has been deleted
  - resource "aws_instance" "app_server" {
      - id                                   = "i-03eab73c7bf0c532c" -> null
        tags                                 = {
            "Name" = "tech-challenge-terraform-server"
        }
        # (32 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_internet_gateway.gw has been deleted
  - resource "aws_internet_gateway" "gw" {
      - id       = "igw-0930f7ac187be0c97" -> null
        tags     = {
            "Name" = "tech-challenge-terraform-igw"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_route_table.public has been deleted
  - resource "aws_route_table" "public" {
      - id               = "rtb-02660e9c8ab07c45d" -> null
        tags             = {
            "Name" = "tech-challenge-terraform-route-table"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.web-sg has been deleted
  - resource "aws_security_group" "web-sg" {
      - id                     = "sg-04beb53515b532a75" -> null
        name                   = "terraform-20250323213444759800000001"
        tags                   = {
            "Name" = "tech-challenge-terraform-sg"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.main has been deleted
  - resource "aws_subnet" "main" {
      - id                                             = "subnet-0b7b19160603a5ff5" -> null
        tags                                           = {
            "Name" = "tech-challenge-terraform-subnet"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.elastic_ip will be created
  + resource "aws_eip" "elastic_ip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # aws_instance.app_server will be created
  + resource "aws_instance" "app_server" {
      + ami                                  = "ami-0718b4ac01274c8cb"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "chave-ssh"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "tech-challenge-terraform-server"
        }
      + tags_all                             = {
          + "Name" = "tech-challenge-terraform-server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "4454345494ab7c7e9c8b68f841ddec985c9ea9fb"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_internet_gateway.gw will be created
  + resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "tech-challenge-terraform-igw"
        }
      + tags_all = {
          + "Name" = "tech-challenge-terraform-igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "tech-challenge-terraform-route-table"
        }
      + tags_all         = {
          + "Name" = "tech-challenge-terraform-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 30001
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 30001
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tech-challenge-terraform-sg"
        }
      + tags_all               = {
          + "Name" = "tech-challenge-terraform-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.main will be created
  + resource "aws_subnet" "main" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tech-challenge-terraform-subnet"
        }
      + tags_all                                       = {
          + "Name" = "tech-challenge-terraform-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "tech-challenge-terraform-vpc"
        }
      + tags_all                             = {
          + "Name" = "tech-challenge-terraform-vpc"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ elastic_ip  = "34.203.183.156" -> (known after apply)
  ~ ssh_command = "ssh -i chave-ssh.pem ubuntu@34.203.183.156" -> (known after apply)
  ~ vpc_id      = "vpc-0aac8157501ffc23c" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shankslevi, Action: `pull_request`*